In [1]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python Docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the read-only "../input/" directory
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os

df = pd.DataFrame()
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        df_path = os.path.join(dirname, filename)
        print(df_path)
        df = pd.read_csv(df_path, encoding='latin-1')

# You can write up to 20GB to the current directory (/kaggle/working/) that gets preserved as output when you create a version using "Save & Run All" 
# You can also write temporary files to /kaggle/temp/, but they won't be saved outside of the current session

In [2]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the read-only "../input/" directory
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os

df = pd.DataFrame()
for dirname, _, filenames in os.walk('/sysroot/home/romanogameplay/PycharmProjects/Projetos/Projetos Data Science/salary_dataset (kaggle)/dados/'):
    for filename in filenames:
        df_path = os.path.join(dirname, filename)
        print(df_path)
        df = pd.read_csv(df_path, encoding='latin-1')

/sysroot/home/romanogameplay/PycharmProjects/Projetos/Projetos Data Science/salary_dataset (kaggle)/dados/saida/Salary_Data.csv
/sysroot/home/romanogameplay/PycharmProjects/Projetos/Projetos Data Science/salary_dataset (kaggle)/dados/entrada/Salary_Data.csv

In [3]:
# Visualização dos dados brutos
df

,ï»¿Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0
...,...,...,...,...,...,...
6699,49.0,Female,PhD,Director of Marketing,20.0,200000.0
6700,32.0,Male,High School,Sales Associate,3.0,50000.0
6701,30.0,Female,Bachelor's Degree,Financial Manager,4.0,55000.0
6702,46.0,Male,Master's Degree,Marketing Manager,14.0,140000.0
6703,26.0,Female,High School,Sales Executive,1.0,35000.0

In [4]:
# Vizualização dos tipos de dados presentes no dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6704 entries, 0 to 6703
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ï»¿Age               6702 non-null   float64
 1   Gender               6702 non-null   object
 2   Education Level      6701 non-null   object
 3   Job Title            6702 non-null   object
 4   Years of Experience  6701 non-null   float64
 5   Salary               6699 non-null   float64
dtypes: float64(3), object(3)
memory usage: 314.4+ KB

In [5]:
# Renomeia a coluna com nome estranho
df.rename(columns={df.columns.values[0]: 'Age'}, inplace=True)

In [6]:
# Visualização dos dados nulos em cada coluna do dataframe
df.isnull().sum().sum()

17

In [7]:
linhas_com_nulos = df[df.isnull().all(axis=1)]

print(linhas_com_nulos)

     Age Gender Education Level Job Title  Years of Experience  Salary
172  NaN    NaN             NaN       NaN                  NaN     NaN
260  NaN    NaN             NaN       NaN                  NaN     NaN

In [8]:
# Remove as linhas que contém,em todas as colunas, dados nulos
df.dropna(how='all', inplace=True)

In [9]:
# Visualiza os dados faltantes após a remoção das linhas
df.isnull().sum()

Age                    0
Gender                 0
Education Level        1
Job Title              0
Years of Experience    1
Salary                 3
dtype: int64

In [10]:
# Uma visualização mais detalhada das colunas e linhas que ainda possuem dados nulos
for c in ['Education Level', 'Years of Experience', 'Salary']:
    print(f'Coluna {c}')
    display(df[df[c].isnull() == True])

Coluna Education Level

       Age Gender Education Level  Job Title  Years of Experience    Salary
2011  27.0   Male             NaN  Developer                  7.0  100000.0

Coluna Years of Experience

       Age  Gender    Education Level Job Title  Years of Experience  Salary
5247  26.0  Female  Bachelor's Degree  Social M                  NaN     NaN

Coluna Salary

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
3136,31.0,Male,Master's Degree,Full Stack Engineer,8.0,NaN
5247,26.0,Female,Bachelor's Degree,Social M,NaN,NaN
6455,36.0,Male,Bachelor's Degree,Sales Director,6.0,NaN

In [11]:
# Análise dos dados da coluna "Job Title"
df.loc[lambda f: (f['Job Title'] == 'Sales Director') & (f['Years of Experience'] == 6.0)]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
6306,29.0,Male,Bachelor's Degree,Sales Director,6.0,75000.0
6360,29.0,Female,Bachelor's Degree,Sales Director,6.0,75000.0
6385,36.0,Male,Bachelor's Degree,Sales Director,6.0,75000.0
6399,36.0,Male,Bachelor's Degree,Sales Director,6.0,75000.0
6413,36.0,Male,Bachelor's Degree,Sales Director,6.0,75000.0
6427,36.0,Male,Bachelor's Degree,Sales Director,6.0,75000.0
6441,36.0,Male,Bachelor's Degree,Sales Director,6.0,75000.0
6455,36.0,Male,Bachelor's Degree,Sales Director,6.0,NaN
6504,36.0,Male,Bachelor's Degree,Sales Director,6.0,75000.0
6518,36.0,Male,Bachelor's Degree,Sales Director,6.0,75000.0
6532,36.0,Male,Bachelor's Degree,Sales Director,6.0,75000.0
6546,36.0,Male,Bachelor's Degree,Sales Director,6.0,75000.0
6560,36.0,Male,Bachelor's Degree,Sales Director,6.0,75000.0
6574,36.0,Male,Bachelor's Degree,Sales Director,6.0,75000.0

In [12]:
# Análise dos dados da coluna "Job Title"
df.loc[lambda f: (f['Job Title'] == 'Full Stack Engineer') & (f['Years of Experience'] == 8.0)]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
1229,36.0,Female,Master's Degree,Full Stack Engineer,8.0,140000.0
1326,36.0,Female,Master's Degree,Full Stack Engineer,8.0,140000.0
1409,36.0,Male,Master's Degree,Full Stack Engineer,8.0,140000.0
1670,35.0,Male,Bachelor's Degree,Full Stack Engineer,8.0,145000.0
1689,35.0,Male,Bachelor's Degree,Full Stack Engineer,8.0,145000.0
1708,35.0,Male,Bachelor's Degree,Full Stack Engineer,8.0,145000.0
1727,35.0,Male,Bachelor's Degree,Full Stack Engineer,8.0,145000.0
1746,35.0,Male,Bachelor's Degree,Full Stack Engineer,8.0,145000.0
1765,35.0,Male,Bachelor's Degree,Full Stack Engineer,8.0,145000.0
1780,35.0,Female,Bachelor's Degree,Full Stack Engineer,8.0,145000.0
2135,35.0,Female,Master's Degree,Full Stack Engineer,8.0,140000.0
2375,34.0,Female,Bachelor's Degree,Full Stack Engineer,8.0,122485.0
2455,34.0,Female,Bachelor's Degree,Full Stack Engineer,8.0,122485.0
2575,33.0,Female,Master's Degree,Full Stack Engineer,8.0,122581.0
2634,32.0,Female,Master's Degree,Full Stack Engineer,8.0,123781.0
2792,33.0,Female,Bachelor's Degree,Full Stack Engineer,8.0,124071.0
2821,33.0,Female,Master's Degree,Full Stack Engineer,8.0,122970.0
2911,33.0,Female,Bachelor's Degree,Full Stack Engineer,8.0,124071.0
2940,33.0,Female,Master's Degree,Full Stack Engineer,8.0,122970.0
3030,33.0,Female,Bachelor's Degree,Full Stack Engineer,8.0,124071.0
3059,33.0,Female,Master's Degree,Full Stack Engineer,8.0,122970.0
3097,31.0,Male,Master's Degree,Full Stack Engineer,8.0,120288.0
3136,31.0,Male,Master's Degree,Full Stack Engineer,8.0,NaN

In [13]:
# Preenchimento dos valoes nulos contidos na coluna "Salary"
df.loc[lambda f: (f['Job Title'] == 'Sales Director') & (f['Salary'].isnull() == True) & (f['Years of Experience'] == 6.0), 'Salary'] = 75000.0
df.loc[lambda f: (f['Job Title'] == 'Full Stack Engineer') & (f['Years of Experience'] == 8.0) & (f['Salary'].isnull() == True), 'Salary'] = 140000.0

In [14]:
# Verificação dos dados nulos restntes
df.isnull().sum()

Age                    0
Gender                 0
Education Level        1
Job Title              0
Years of Experience    1
Salary                 1
dtype: int64

In [15]:
# Como os dados nulos restantes não podem ser preenchidos de algum modo, então, a única alternativa para o tratamento destes dados é sua exclusão
df.dropna(inplace=True)

In [16]:
# Verifica se existe algum trabalhador com salário anual abaixo do mínimo estabelecido de $ 15.312 dólares
df[df['Salary'] <= 16000]

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
259,29.0,Male,Bachelor's,Junior Business Operations Analyst,1.5,350.0
1890,25.0,Female,Bachelor's Degree,Front end Developer,1.0,550.0
2654,23.0,Male,PhD,Software Engineer Manager,1.0,579.0
4633,31.0,Female,Bachelor's Degree,Junior HR Coordinator,4.0,500.0

In [17]:
# Exclusão de tais linhas
ind = df[df['Salary'] <= 16000].index
df.drop(index=ind, inplace=True)

In [18]:
# Verifica se existe algum dado estranho dentre os valores dentro da coluna "Gender"
df['Gender'].value_counts()

Gender
Male      3671
Female    3011
Other       14
Name: count, dtype: int64

In [19]:
# Verifica se existe algum dado estranho dentre os valores dentro da coluna "Education Level"
df['Education Level'].value_counts()

Education Level
Bachelor's Degree    2264
Master's Degree      1573
PhD                  1367
Bachelor's            755
High School           448
Master's              288
phD                     1
Name: count, dtype: int64

In [20]:
# Alteração dos valores estranhos dentro da coluna "Education Level"
df['Education Level'].replace("Master's", "Master's Degree", inplace=True)
df['Education Level'].replace("Bachelor's", "bachelor's Degree", inplace=True)
df['Education Level'].replace("phD", "PhD", inplace=True)

In [21]:
# Verifica se existe algum dado estranho dentre os valores dentro da coluna "Job Title"
df['Job Title'].value_counts()

Job Title
Software Engineer             518
Data Scientist                453
Software Engineer Manager     375
Data Analyst                  363
Senior Project Engineer       318
                             ...
Account Manager                 1
Help Desk Analyst               1
Senior Training Specialist      1
Junior Web Designer             1
Software Project Manager        1
Name: count, Length: 191, dtype: int64

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6696 entries, 0 to 6703
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6696 non-null   float64
 1   Gender               6696 non-null   object
 2   Education Level      6696 non-null   object
 3   Job Title            6696 non-null   object
 4   Years of Experience  6696 non-null   float64
 5   Salary               6696 non-null   float64
dtypes: float64(3), object(3)
memory usage: 366.2+ KB

In [23]:
# Mudança dos tipos de dados de detrminadas colunas para minimizar o uso de memória
df['Age'] = df['Age'].astype(np.uint)
df['Years of Experience'] = df['Years of Experience'].astype(np.uint)
df['Gender'] = df['Gender'].astype('category')
df['Salary'] = df['Salary'].astype(np.uint)
df['Education Level'] = df['Education Level'].astype('category')
df['Job Title'] = df['Job Title'].astype('category')

# Redução de mais de 100KB de uso de memória
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6696 entries, 0 to 6703
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6696 non-null   uint64
 1   Gender               6696 non-null   category
 2   Education Level      6696 non-null   category
 3   Job Title            6696 non-null   category
 4   Years of Experience  6696 non-null   uint64
 5   Salary               6696 non-null   uint64
dtypes: category(3), uint64(3)
memory usage: 241.3 KB

In [24]:
# Visualização dos dados após a análise
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32,Male,bachelor's Degree,Software Engineer,5,90000
1,28,Female,Master's Degree,Data Analyst,3,65000
2,45,Male,PhD,Senior Manager,15,150000
3,36,Female,bachelor's Degree,Sales Associate,7,60000
4,52,Male,Master's Degree,Director,20,200000
...,...,...,...,...,...,...
6699,49,Female,PhD,Director of Marketing,20,200000
6700,32,Male,High School,Sales Associate,3,50000
6701,30,Female,Bachelor's Degree,Financial Manager,4,55000
6702,46,Male,Master's Degree,Marketing Manager,14,140000
6703,26,Female,High School,Sales Executive,1,35000

In [25]:
df.isnull().sum()

Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64